# Argentina's Inflation Analysis vs. Common Investments

## Introduction

üìàüìä In this data analysis project, we will delve into the study of inflation in Argentina and its relationship with the most common investment mechanisms in the country. The main objective is to compare the evolution of inflation in Argentina with the results obtained through the most common investments, such as **purchasing dollars and fixed-term deposits**. Additionally, we will examine the relationship between Argentine inflation and the **inflation of the US dollar** and the performance of the **S&P 500 index** as relevant global indicators.

From the year 2000 to the present day, Argentina has faced significant economic challenges that have influenced the evolution of inflation. This analysis will provide valuable insights for investors, allowing them to better understand the impact of inflation on different investment strategies and gain a more comprehensive view of the Argentine financial landscape.

‚ö†Ô∏è This analysis covers the time period from **2000 to the present day (2023).**

## The Data

We collected data on the evolution of the following assets between 2005 and 2023. Depending on the asset, the data frequency is monthly or daily, although this will be adjusted at the data cleaning stage:

* U.S. dollar inflation
* Performance of the SPY (SPDR S&P 500 ETF Trust)
* Interest rate paid by retail time deposits for 30-day deposits in Argentine pesos.
* Evolution of the price of the U.S. dollar in Argentine pesos, both in its official version and in the so-called Dolar Blue or parallel dollar.

**What is the so called "Blue" dollar in Argentina?**

The "Blue" dollar in Argentina is the unofficial exchange rate for the U.S. dollar, determined in the informal market. It operates outside official controls, reflecting supply and demand dynamics. 

Currency controls imposed by the Argentine government create the Dolar Blue market, aiming to manage reserves and stabilize the official exchange rate. Discrepancies between official and informal rates drive the emergence of the Dolar Blue as an alternative currency exchange channel.

## Libraries and Dependencies

In [1]:
import pandas as pd

## Stemp 1: Data Cleaning

The information for the analysis was obtained from different sources and is presented in different formats. It is necessary to homogenize the data in order to continue with the analysis.

### 1.1 Plazo Fijo (fixed-term deposits)

In [2]:
pf_df = pd.read_csv('Sources/Data/Tasa Plazo Fijo.csv')

In [3]:
pf_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 328 entries, 0 to 327
Data columns (total 3 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   indice_tiempo                        328 non-null    object
 1   tasas_interes_plazo_fijo_30_59_dias  328 non-null    float64
 2   instr_bcra_tasa_politica_monetaria   88 non-null     float64
dtypes: float64(2), object(1)
memory usage: 7.8+ KB

In [4]:
pf_df

,indice_tiempo,tasas_interes_plazo_fijo_30_59_dias,instr_bcra_tasa_politica_monetaria
0,1/1/1996,8.615812,NaN
1,2/1/1996,7.621402,NaN
2,3/1/1996,7.274122,NaN
3,4/1/1996,7.106231,NaN
4,5/1/1996,6.662615,NaN
...,...,...,...
323,12/1/2022,68.751500,75.000000
324,1/1/2023,68.941364,75.000000
325,2/1/2023,69.008333,75.000000
326,3/1/2023,70.216818,76.500000
327,4/1/2023,73.589444,80.277778

In [5]:
pf_df['date'] = pd.to_datetime(pf_df.indice_tiempo, format = '%m/%d/%Y')

Since 2016, the Argentine government started to intervene banks to fix the minimum interest rate they had to offer for time deposits. This was called "monetary policy rate" and is the value that will be taken as a reference since 2016. For values prior to that date, we will take the average value of the rate paid by the average of the banks.

In [6]:
# Calculate monthly return
pf_df['anual_return_rate'] = pf_df['instr_bcra_tasa_politica_monetaria'].fillna(pf_df['tasas_interes_plazo_fijo_30_59_dias']).round(2)
pf_df['monthly_return_rate'] = pf_df['anual_return_rate'] / 12
pf_df['monthly_return_rate'] = pf_df['monthly_return_rate'].round(4)

#  Use date as index
pf_df.index = pf_df.date

# Remove unnecesary columns
pf_df = pf_df.drop(['indice_tiempo', 'instr_bcra_tasa_politica_monetaria', 'tasas_interes_plazo_fijo_30_59_dias', 'date'], axis = 1)

pf_df

            anual_return_rate  monthly_return_rate
date
1996-01-01               8.62               0.7183
1996-02-01               7.62               0.6350
1996-03-01               7.27               0.6058
1996-04-01               7.11               0.5925
1996-05-01               6.66               0.5550
...                       ...                  ...
2022-12-01              75.00               6.2500
2023-01-01              75.00               6.2500
2023-02-01              75.00               6.2500
2023-03-01              76.50               6.3750
2023-04-01              80.28               6.6900

[328 rows x 2 columns]

### 1.2 SPY Return

In [7]:
spy_df = pd.read_csv('Sources/Data/SPY Return.csv')

In [8]:
spy_df

         Date   Price    Open    High     Low     Vol.  Change %
0    5/1/2023  410.25  415.62  417.59  403.76   56.74M   -0.0137
1    4/1/2023  415.93  408.85  415.94  403.78    1.40B    0.0160
2    3/1/2023  409.39  395.41  409.70  380.65    2.52B    0.0331
3    2/1/2023  396.26  405.21  418.31  393.64    1.60B   -0.0251
4    1/1/2023  406.48  384.37  408.16  377.83    1.58B    0.0629
..        ...     ...     ...     ...     ...      ...       ...
228  5/1/2004  112.86  111.37  113.26  108.06  984.92M    0.0171
229  4/1/2004  110.96  113.07  115.41  110.90  969.26M   -0.0189
230  3/1/2004  113.10  115.43  116.97  108.85    1.13B   -0.0167
231  2/1/2004  115.02  113.70  116.60  112.78  676.31M    0.0136
232  1/1/2004  113.48  111.74  116.50  110.73  746.62M    0.0198

[233 rows x 7 columns]

In [9]:
spy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233 entries, 0 to 232
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      233 non-null    object
 1   Price     233 non-null    float64
 2   Open      233 non-null    float64
 3   High      233 non-null    float64
 4   Low       233 non-null    float64
 5   Vol.      233 non-null    object
 6   Change %  233 non-null    float64
dtypes: float64(5), object(2)
memory usage: 12.9+ KB

We will use the "Price" column to calculate monthly revenue

In [10]:
spy_df['date'] = pd.to_datetime(spy_df.Date, format = '%m/%d/%Y')

# Sort Values
spy_df = spy_df.sort_values('date')

# Calculate percentual monthly change
spy_df['monthly_return_rate'] = spy_df['Price'].pct_change() * 100

# Remove first row as it has NaN
spy_df = spy_df.iloc[1:]

# Use date as index
spy_df = spy_df.reset_index(drop=True)
spy_df.index = spy_df['date']

# Remove unnecesary columns
spy_df = spy_df.rename(columns={'Price': 'price'})
spy_df = spy_df.drop(['Date', 'date', 'Open', 'High', 'Low', 'Change %', 'Vol.'], axis = 1)


spy_df

             price  monthly_return_rate
date
2004-02-01  115.02             1.357067
2004-03-01  113.10            -1.669275
2004-04-01  110.96            -1.892131
2004-05-01  112.86             1.712329
2004-06-01  114.53             1.479709
...            ...                  ...
2023-01-01  406.48             6.288733
2023-02-01  396.26            -2.514269
2023-03-01  409.39             3.313481
2023-04-01  415.93             1.597499
2023-05-01  410.25            -1.365614

[232 rows x 2 columns]

### 1.3 Official Dollar

In [11]:
dol_of_df = pd.read_csv('Sources/Data/Dolar Oficial.csv')

dol_of_df

           date  last_price  open_price  max_price  min_price  avg_price
0    2023-05-01       226.2       222.5      226.7      222.5      224.4
1    2023-04-01       222.6       208.9      222.7      208.9      215.8
2    2023-03-01       209.0       197.6      209.0      197.2      203.3
3    2023-02-01       197.2       186.9      197.2      186.9      192.0
4    2023-01-01       187.0       177.6      187.0      177.6      182.3
..          ...         ...         ...        ...        ...        ...
156  2010-05-01         3.9         3.9        3.9        3.9        3.9
157  2010-04-01         3.9         3.9        3.9        3.9        3.9
158  2010-03-01         3.9         3.9        3.9        3.9        3.9
159  2010-02-01         3.9         3.8        3.9        3.8        3.8
160  2010-01-01         3.8         3.8        3.8        3.8        3.8

[161 rows x 6 columns]

In [12]:
# Use date as index
dol_of_df['date'] = pd.to_datetime(dol_of_df.date, format = '%Y-%m-%d')
dol_of_df = dol_of_df.sort_values('date')
dol_of_df.index = dol_of_df['date']
dol_of_df = dol_of_df.rename(columns={'avg_price': 'price'})

# Calculate monthly return
dol_of_df['monthly_return_rate'] = dol_of_df['price'].pct_change() * 100
dol_of_df['monthly_return_rate'] = dol_of_df['monthly_return_rate'].round(4).fillna(0)

# Remove unnecesary columns
dol_of_df = dol_of_df.drop(['last_price', 'open_price', 'max_price', 'min_price', 'date'], axis = 1)

dol_of_df

            price  monthly_return_rate
date
2010-01-01    3.8               0.0000
2010-02-01    3.8               0.0000
2010-03-01    3.9               2.6316
2010-04-01    3.9               0.0000
2010-05-01    3.9               0.0000
...           ...                  ...
2023-01-01  182.3               5.9884
2023-02-01  192.0               5.3209
2023-03-01  203.3               5.8854
2023-04-01  215.8               6.1485
2023-05-01  224.4               3.9852

[161 rows x 2 columns]

### 1.4 Blue Dollar

In [73]:
dol_bl_df = pd.read_csv('Sources/Data/Dolar Blue.csv')

dol_bl_df

      Year  Month  Day buy_price sell_price
0     2023      5   24       487        492
1     2023      5   23       485        490
2     2023      5   22       481        486
3     2023      5   19       483        488
4     2023      5   18       482        487
...    ...    ...  ...       ...        ...
4541  2005      1    7      2,98       2,98
4542  2005      1    6      2,98       2,98
4543  2005      1    5      2,97       2,98
4544  2005      1    4      2,97       2,98
4545  2005      1    3      2,98       2,98

[4546 rows x 5 columns]

In [74]:
dol_bl_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4546 entries, 0 to 4545
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        4546 non-null   int64
 1   Month       4546 non-null   int64
 2   Day         4546 non-null   int64
 3   buy_price   4546 non-null   object
 4   sell_price  4546 non-null   object
dtypes: int64(3), object(2)
memory usage: 177.7+ KB

This table contains daily records so we will keep just the first record of each month. Some days are also missing, as it will only considers monday to fridays. We will add those missing dates and fill them with the last non-null price

In [75]:
first_sunday = {'Year': 2005, 'Month': 1, 'Day': 2, 'buy_price': '2,98', 'sell_price': '2,98'}
first_saturday = {'Year': 2005, 'Month': 1, 'Day': 1, 'buy_price': '2,98', 'sell_price': '2,98'}

dol_bl_df.loc[len(dol_bl_df)] = first_sunday
dol_bl_df.loc[len(dol_bl_df)] = first_saturday

In [76]:
dol_bl_df['date'] = pd.to_datetime(dol_bl_df[['Year', 'Month', 'Day']], format = '%Y-%d-%m')

# Identify the minimum and maximum dates
min_date = dol_bl_df['date'].min()
max_date = dol_bl_df['date'].max()

# Generate a sequence of dates
date_range = pd.date_range(start=min_date, end=max_date, freq='D')

# Merge the generated date sequence with the original dataset
merged_df = pd.DataFrame({'date': date_range})
merged_df = merged_df.merge(dol_bl_df, on='date', how='left')

# Fill missing values with the last non-null value (forward filling)
merged_df['buy_price'] = merged_df['buy_price'].fillna(method='ffill')
merged_df['sell_price'] = merged_df['sell_price'].fillna(method='ffill')

merged_df

           date    Year  Month   Day buy_price sell_price
0    2005-01-01  2005.0    1.0   1.0      2,98       2,98
1    2005-01-02  2005.0    1.0   2.0      2,98       2,98
2    2005-01-03  2005.0    1.0   3.0      2,98       2,98
3    2005-01-04  2005.0    1.0   4.0      2,97       2,98
4    2005-01-05  2005.0    1.0   5.0      2,97       2,98
...         ...     ...    ...   ...       ...        ...
6749 2023-05-20     NaN    NaN   NaN       483        488
6750 2023-05-21     NaN    NaN   NaN       483        488
6751 2023-05-22  2023.0    5.0  22.0       481        486
6752 2023-05-23  2023.0    5.0  23.0       485        490
6753 2023-05-24  2023.0    5.0  24.0       487        492

[6754 rows x 6 columns]

In [77]:
# Use date as index
merged_df = merged_df.sort_values('date')
merged_df.index = merged_df['date']

# Keep just the first record of each month
merged_df = merged_df[merged_df['date'].dt.is_month_start]

# Replace comma with period in 'buy_price' and 'sell_price' columns
merged_df['buy_price'] = merged_df['buy_price'].str.replace(',', '.')
merged_df['sell_price'] = merged_df['sell_price'].str.replace(',', '.')

# Convert 'buy_price' and 'sell_price' columns to numeric type
merged_df['buy_price'] = pd.to_numeric(merged_df['buy_price'])
merged_df['sell_price'] = pd.to_numeric(merged_df['sell_price'])

# Calculate monthly return
merged_df['price'] = (merged_df['buy_price'] + merged_df['sell_price']) / 2
merged_df['monthly_return_rate'] = merged_df.price.pct_change() * 100
merged_df['monthly_return_rate'] = merged_df.monthly_return_rate.round(4).fillna(0)

# Remove unnecesary columns
merged_df = merged_df.drop(['buy_price', 'sell_price', 'Year', 'Month', 'Day', 'date'], axis = 1)

merged_df

              price  monthly_return_rate
date
2005-01-01    2.980               0.0000
2005-02-01    2.925              -1.8456
2005-03-01    2.935               0.3419
2005-04-01    2.930              -0.1704
2005-05-01    2.905              -0.8532
...             ...                  ...
2023-01-01  344.000              10.6109
2023-02-01  379.000              10.1744
2023-03-01  373.000              -1.5831
2023-04-01  390.500               4.6917
2023-05-01  464.500              18.9501

[223 rows x 2 columns]